index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-04 Sat 22:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>AKhanna.Net</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
Love. Peace. Kindness
</div>
<div id="content">
<h1 class="title">AKhanna.Net</h1>
<p>
Welcome to AKhanna.Net! A website focused on the intersection of maths &amp;
technology. I am currently working on various mathematical software
using Common Lisp and this website documents all my knowledge in Lisp,
Emacs, Computer Science and Mathematics (more to come later on this - right
now my focus is on the technology stack). In addition, this website serves
as my public facing blog and also as a document store for valuable
resources I come across.
</p>

<p>
I hope you enjoy and find Math.Dev a useful resource for you. I love to
chat and get feedback from others, so please do drop me an e-mail at
ashok.khanna@hotmail.com if you have similar interests and would like to
chat some more. If you yourself work on Mathematical software, I would
<i>especially</i> like to hear from you! :)
</p>

<p>
A reasonable amount of my work is available on <a href="https://ashok-khanna.github.io">my GitHub profile</a>, so check
me out there!
</p>

<div id="outline-container-org1d6b35d" class="outline-2">
<h2 id="org1d6b35d">Lisp Resources</h2>
<div class="outline-text-2" id="text-org1d6b35d">
<ol class="org-ol">
<li><a href="lisp/clbe/index.html">Common Lisp by Example</a> - My ongoing introductory guide for Common Lisp</li>
<li><a href="lisp/sicp/index.html">SICP &amp; CL</a> - My notes on SICP and solutions in Common Lisp (I'm just starting,
so it will take some time for these to be completed!)</li>
</ol>
</div>
</div>


<div id="outline-container-org62dd2ce" class="outline-2">
<h2 id="org62dd2ce">Emacs Resources</h2>
<div class="outline-text-2" id="text-org62dd2ce">
<p>
This website was built entirely with Org-Mode. I will shortly publish
an article on how to achieve this, stay tuned!
</p>

<ol class="org-ol">
<li><a href="emacs/tips.html">Useful Tips &amp; Tricks</a> - An unorganised collection of useful tips &amp; tricks
for Emacs</li>
</ol>
</div>
</div>


<div id="outline-container-org67803e7" class="outline-2">
<h2 id="org67803e7">Math Resources</h2>
<div class="outline-text-2" id="text-org67803e7">
<ol class="org-ol">
<li><a href="https://apps.apple.com/us/app/rpn-30/id1451413517">RPN 30</a> - My highly rated Reverse Polish Notation calculator for iPhones.
It has over 15,000 downloads and counting :-) I will add a selection of its
reviews here shortly.</li>
</ol>
</div>
</div>


<div id="outline-container-orgff0e979" class="outline-2">
<h2 id="orgff0e979">Computer Science Resources</h2>
<div class="outline-text-2" id="text-orgff0e979">
<p>
I am currently reading The Design and Analysis of Computer Algorithms by Alfred
Aho, Jeffrey Ullman and John Hopcroft. I will publish a concise summary here
as I work through this book.
</p>
</div>
</div>


<div id="outline-container-org78dc764" class="outline-2">
<h2 id="org78dc764">Other Resources</h2>
<div class="outline-text-2" id="text-org78dc764">
<ol class="org-ol">
<li><a href="https://pdf.math.dev">Beautiful PDFs from HTML</a> - My tutorial on using Paged.Js to produce paginated
media from HTML. It has been read over 20,000 times. A good read for anybody
looking to automate PDF report generation by taking advantage of Chrome's rendering
engine (preferably in a headless setup). The accompanying Hacker News discussion
can be found <a href="https://news.ycombinator.com/item?id=26691626">here</a>.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
